app/controllers/books_controller.rb

  def index
    if params[:author_id].present?
      @books = Book.where(author_id: params[:author_id])
    else
      @books = Book.all
---
SELECT `books`.* FROM `books` WHERE `books`.`author_id` = 2
SELECT `books`.* FROM `books`

  def teste
    @books = Book.where(title: "Livro 1")
---
SELECT `books`.* FROM `books` WHERE `books`.`title` = 'Livro 1'